// FileSyncUI Localizable.strings

// The name of the product
"FileSyncUI" = "Синхронизация файла";

// Text of "ok" button, used in various dialogs.
"OK" = "ОК";

// Text of "cancel" button, used in various dialogs.
"CANCEL" = "Отменить";

// Text of "Next" button, used in various dialogs
"NEXT" = "Далее";

// Text of "Done" button, used in various dialogs
"DONE" = "Готово";

// Text of "Continue" button, used in various dialogs
"CONTINUE" = "Продолжить";


// ------------------------
// Exception (error) window

"DESTINATION:" = "Место назначения:";	// Destination label - prefixes the destination path of a symlink.
"MODIFIED:"    = "Изменено:";		// Modified label - prefixes the displayed mod date
"NAME:"        = "Имя:";			// Name label - prefixes the name of the file
"SIZE:"        = "Размер:";			// Size label - prefixes the displayed size of the file
"IDISK"		   = "iDisk";			// Prefixing the path with "iDisk/" when appropriate

// These labels tell the user which side of the mirror the file which caused the error resides on
"THIS_COMPUTER" = "На этом компьютере";	// For iDisk
".MAC"          = "На %@";				// For iDisk
"LOCAL_MHD"     = "На этом компьютере";	// For Mobile Home Directories (MHD)
"REMOTE_MHD"    = "В сети";		// For MHD

// To reveal the errored file in Finder when appropriate
"SHOW IN FINDER" = "Показать в Finder";


// ------------------------
// Exception (error) dialog

// The title of the exception dialog.
"IDISK ERROR TITLE" = "Ошибка iDisk";
"MHD ERROR TITLE"   = "Ошибка синхронизации папки пользователя";
"FS ERROR TITLE"    = "Ошибка синхронизации папки";

// Error code. The argument is an integer number, such as -43.
"ERROR%" = "Код ошибки — %d.";

// Exception count.
// The first argument is an integer index, the second is the total number of errors. E.g., "iDisk Error 1 of 5"
"IDISK ERROR COUNT%" = "iDisk-ошибка %d из %d";
"MHD ERROR COUNT%"   = "Ошибка синхронизации папки пользователя: %d из %d";
"FS ERROR COUNT%"    = "Ошибка синхронизации папки: %d из %d";

// Title text of the error. Two variations, only one is used at a time.
// The argument is a filename.
"ERROR DELETING%"      = "Существует проблема удаления файла «%@».";
"ERROR SYNCING%"       = "Проблема синхронизации файла «%@».";
"ERROR MOVING%"        = "Существует проблема перемещения файла «%@».";
"ERROR ACCESSING%"     = "Проблема синхронизации файла «%@».";
"DIR:ERROR DELETING%"  = "Существует проблема удаления папки «%@».";
"DIR:ERROR SYNCING%"   = "Существует проблема синхронизации папки «%@».";
"DIR:ERROR MOVING%"    = "Существует проблема перемещения папки «%@».";
"DIR:ERROR ACCESSING%" = "Существует проблема синхронизации папки «%@».";


// ------------------------
// Exception dialog error messages.
// The first string is a short description of the error.
// The second string is additional help text.

// dskFulErr
// The first three strings are variations of the short description: iDisk, mobile home, and general syncing.
"IDISK DSKFULERR"      = "iDisk почти заполнен. На iDisk недостаточно места для синхронизации данного объекта.";
"MHD DSKFULERR"        = "Ваша папка пользователя почти заполнена. Недостаточно свободного места для синхронизации этого объекта.";
"FS DSKFULERR"         = "Диск почти заполнен. На диске недостаточно места для синхронизации данного объекта.";
"IDISK DSKFULERR HELP" = "iDisk содержит файлы, которые находятся в Корзине. Чтобы освободить больше места, очистите Корзину.";

// afpAccessDenied
// The first two strings are variations of the short description: deleting, syncing
"AFPACCESSDENIED DELETE"     = "У Вас нет разрешения на удаление этого файла.";
"AFPACCESSDENIED SYNC"       = "У Вас нет разрешения на синхронизацию этого файла.";
"DIR:AFPACCESSDENIED DELETE" = "У Вас нет разрешения на удаление этой папки.";
"DIR:AFPACCESSDENIED SYNC"   = "У Вас нет разрешения на синхронизацию этой папки.";
"AFPACCESSDENIED HELP"       = "Вы можете проверить Ваши права доступа в панели свойств в Finder.";

// kSFFileNameDiffersByCase
// The first three strings are variations of the short description: iDisk, mobile home, general syncing.
"IDISK KSFFILENAMEDIFFERSBYCASE"     = "Имя данного файла такое же, как и имя другого файла на iDisk, за исключением использования некоторых прописных букв.";
"MHD KSFFILENAMEDIFFERSBYCASE"       = "Имя данного файла такое же, как и имя другого файла в папке пользователя, за исключением использования некоторых прописных букв.";
"FS KSFFILENAMEDIFFERSBYCASE"        = "Имя данного файла такое же, как и имя другого файла на Вашем диске, за исключением использования некоторых прописных букв.";
"DIR:IDISK KSFFILENAMEDIFFERSBYCASE" = "Имя данного файла такое же, как и имя другого файла на iDisk, за исключением использования некоторых прописных букв.";
"DIR:MHD KSFFILENAMEDIFFERSBYCASE"   = "Имя данного файла такое же, как и имя другого файла в папке пользователя, за исключением использования некоторых прописных букв.";
"DIR:FS KSFFILENAMEDIFFERSBYCASE"    = "Имя данного файла такое же, как и имя другого файла на Вашем диске, за исключением использования некоторых прописных букв.";
"KSFFILENAMEDIFFERSBYCASE HELP"      = "Следует изменить имя этого файла так, чтобы оно отличалось более значительным образом. Например, добавьте к имени номер.";

// fBsyErr
"FSBSYERR"      = "Файл используется.";
"FSBSYERR HELP" = "Вероятно, некая программа открыла файл. Закройте файл или завершите программы.";

// fLckdErr
"FLCKDERR"      = "Файл заблокирован.";
"DIR:FLCKDERR"  = "Папка заблокирована.";
"FLCKDERR HELP" = "Вы можете разблокировать объект с помощью Свойств в Finder.";

"File Not Found"      = "Файл не найден.";
"HELP:File Not Found" = "Вероятно, файл был перемещен при синхронизации. Повторите синхронизацию.";

"File Name Too Long"      = "Имя файла или папки слишком длинное.";
"HELP:File Name Too Long" = "Переименуйте объект, чтобы укоротить его имя.";

"I/O Error"      = "Ошибка при чтении или записи файла.";
"HELP:I/O Error" = "Повторите попытку позже.";

"Destination does not support symlinks"      = "Место назначения не поддерживает символические ссылки.";
"HELP:Destination does not support symlinks" = "Попытайтесь сначала сжать файл или папку.";

"Object deleted"      = "Объект был удален до синхронизации.";
//"HELP:Object deleted" = "";

"Object created"      = "До синхронизации объекта по тому же адресу был создан новый объект.";
//"HELP:Object created" = "";

"Object modified"     = "Данный объект обновления был изменен другой программой до синхронизации.";
//"HELP:Object modified" = "";

"Network error"       = "Произошла ошибка сети.";
"HELP:Network error"  = "Проверьте сетевое подключение или повторите попытку позже.";

//"Timeout Error"       = "The server has stopped responding.";

"Unknown error"            = "Возникла проблема.";					// [rdar://5231555]
"HELP:Unknown error"       = "Повторите попытку позже.";
"HELP-IDISK:Unknown error" = "Повторите попытку позже.";
"HELP-PHD:Unknown error"   = "Повторите попытку позже. Если проблема останется, обратитесь к сетевому администратору.";

"IDISK ALMOST FULL"     = "iDisk почти заполнен.";
"ALMOST FULL TRASH MSG" = "iDisk содержит файлы, находящиеся в Корзине. Чтобы освободить больше места, очистите Корзину.\n\nВы можете увеличить размер iDisk, перейдя в панель «%@» Системных настроек.";
"ALMOST FULL .MAC MSG"  = "Вы можете увеличить размер iDisk, перейдя в панель «%@» Системных настроек.";

"REVERIFICATION"      = "В ходе последних синхронизаций (%@) файл изменялся.";
"REVERIFICATION HELP" = "Вероятно, некая программа вносит изменения в файл. Закройте файл или завершите программы.";

"TOO_MANY_EAS"      = "Место назначения не поддерживает некоторые из данных, содержащихся в этом объекте.";
"TOO_MANY_EAS HELP" = "Попытайтесь сначала сжать файл или папку.";

// ---------------------
// offline folder dialog

"OFFLINE FOLDER%"    = "Папка %@ доступна только тогда, когда iDisk находится в режиме онлайн.";
"OFFLINE FOLDER MSG" = "Чтобы получить доступ к данной папке, Вам необходимо подключить компьютер к Интернету.";


// Size formats, used in the conflict and exception dialog to show file sizes.
// The argument is the number of bytes, the suffixes are the abbreviations for the standard metric scales: kilobytes, megabytes, etc.
"%BYTES" = "%llu байт.";
"%KB"    = "КБ: %.2f";
"%MB"    = "МБ: %.2f";
"%GB"    = "%.2f ГБ";
"%TB"    = "ТБ: %.2f";
"%PB"    = "ПБ: %.2f";
"%XB"    = "ЭБ: %.2f";


// --------------------
// Conflict list window

// Conflict count. Singular and plural. The plural argument is an integer. Used in the conflict *list* window, not the conflict resolution window
"1CONFLICT"  = "1 расхождение";
"%CONFLICTS" = "Расхождений: %d";


// -----------------------
// Conflict manager window

"%IS_OUT_OF_SYNC"          = "Объект «%@» был изменен в обоих местоположениях.";			// Name of conflicting item.
"%WHERE"                   = "Путь: %@";						// Path to parent folder of conflicting item.
"%CONFLICT_COUNT"          = "%d из %d";						// Conflict count (arguments are integers i.e., "1 of 16")
"ROOT"                     = "-корень-";							// The name of the root of the sync point, rather than @"/"
"FILE"                     = "файл";
"FOLDER"                   = "папка";
"PACKAGE"                  = "пакет";
"SYMLINK"                  = "символьная ссылка";
"IDISK_LOCAL_TITLE"        = "Этот компьютер";
"IDISK_POPUP_LOCAL_TITLE"  = "Оставить файл на компьютере";
"IDISK_POPUP_REMOTE_TITLE" = "Оставить файл в %@";
"MHD_LOCAL_TITLE"          = "На этом компьютере";
"MHD_REMOTE_TITLE"         = "В сети";
"MHD_POPUP_LOCAL_TITLE"    = "Оставить файл на компьютере";
"MHD_POPUP_REMOTE_TITLE"   = "Оставить файл в сети";
"1_IDISK_CONFLICT"         = "Имеется расхождение при синхронизации iDisk.";			// Singular for iDisk
"%_IDISK_CONFLICTS"        = "Расхождений при синхронизации iDisk: %d.";			// Plural for iDisk
"1_MHD_CONFLICT"           = "Расхождение при синхронизации папки пользователя.";				// Singular for MHD
"%_MHD_CONFLICTS"          = "Расхождений при синхронизации папки пользователя: %d.";			// Plural for MHD
"IDISK_RESOLVE_REMOTE"     = "Устранить все расхождения, используя файлы в %@";
"IDISK_RESOLVE_LOCAL"      = "Устранить все расхождения, используя файлы на этом компьютере";
"IDISK_RESOLVE_BOTH"       = "Устранить все расхождения, сохранив оба файла";
"IDISK_RESOLVE_LASTMOD"    = "Устранить все конфликты, сохранив файл с более новой датой изменения.";
"IDISK_RESOLVE_EXCLUDE"    = "Устранить все расхождения, исключив файлы из будущих синхронизаций.";
"IDISK_RESOLVE_NONE"       = "Игнорировать все расхождения.";
"MHD_RESOLVE_REMOTE"       = "Устранить все расхождения, используя файлы в сети";
"MHD_RESOLVE_LOCAL"        = "Устранить все расхождения, используя файлы на этом компьютере";
"MHD_RESOLVE_BOTH"         = "Устранить все расхождения, сохранив оба файла";
"MHD_RESOLVE_LASTMOD"      = "Устранить все конфликты, сохранив файл с более новой датой изменения.";
"MHD_RESOLVE_EXCLUDE"      = "Устранить все расхождения, исключив файлы из будущих синхронизаций.";
"MHD_RESOLVE_NONE"         = "Игнорировать все расхождения.";
"MHD_CONFLICT_TITLE"       = "Расхождения синхронизации";

// Unable to resolve all conflicts alert sheet
"NOT_ALL_RESOLVED_TITLE" = "Невозможно устранить все расхождения";
"NOT_ALL_RESOLVED_MSG"   = "Не удалось устранить некоторые расхождения, т. к. прошло слишком мало времени между датами их изменения. Устраните эти расхождения вручную или с помощью иной функции.";

"There are no file syncing errors or conflicts." = "Нет ошибок синхронизации файла или расхождений. ";

// -----------------
// Global Exceptions

// iDisk
"GLOBAL-IDISK:Timeout"      = "Синхронизация iDisk не была завершена. Повторите попытку позже.";
"GLOBAL-HELP-IDISK:Timeout" = "Если при синхронизации iDisk по-прежнему возникают ошибки, возможно, причиной являются сбои подключения к Интернету. Попробуйте завершить другие программы, использующие Интернет, и повторите попытку.";

"GLOBAL-IDISK:NetworkError"      = "Синхронизация iDisk не была завершена.";
"GLOBAL-HELP-IDISK:NetworkError" = "Проверьте сетевое подключение или повторите попытку позже.";

"GLOBAL-IDISK:RemoteBusy"      = "Синхронизация iDisk не была завершена.";
"GLOBAL-HELP-IDISK:RemoteBusy" = "Повторите попытку позже.";

"GLOBAL-IDISK:UNKNOWN"      = "Синхронизация iDisk не была завершена из-за возникшей ошибки.";
"GLOBAL-HELP-IDISK:UNKNOWN" = "Повторите попытку позже.";

// PHD
"GLOBAL-PHD:Timeout"      = "Синхронизация папки пользователя не была завершена. Повторите попытку позже.";
"GLOBAL-HELP-PHD:Timeout" = "Если при синхронизации папки пользователя по-прежнему возникают ошибки, возможно, причиной являются сбои сетевого подключения. Попробуйте завершить другие программы, использующие сеть, и повторите попытку.";

"GLOBAL-PHD:NetworkError"      = "Синхронизация папки пользователя не была завершена.";
"GLOBAL-HELP-PHD:NetworkError" = "Проверьте сетевое подключение или повторите попытку позже.";

"GLOBAL-PHD:RemoteBusy"      = "Синхронизация папки пользователя не была завершена.";
"GLOBAL-HELP-PHD:RemoteBusy" = "Повторите попытку позже.";

"GLOBAL-PHD:UNKNOWN"      = "Синхронизация папки пользователя не была завершена из-за возникшей ошибки.";
"GLOBAL-HELP-PHD:UNKNOWN" = "Повторите попытку позже.";

// Other
"GLOBAL-FS:Timeout"      = "Синхронизация файлов не была завершена. Повторите попытку позже.";
"GLOBAL-HELP-FS:Timeout" = "Если при синхронизации файлов по-прежнему возникают ошибки, возможно, причиной являются сбои сетевого подключения. Попробуйте завершить другие программы, использующие сеть, и повторите попытку.";

"GLOBAL-FS:NetworkError"      = "Синхронизация файлов не была завершена.";
"GLOBAL-HELP-FS:NetworkError" = "Проверьте сетевое подключение или повторите попытку позже.";

"GLOBAL-FS:RemoteBusy"      = "Синхронизация файлов не была завершена.";
"GLOBAL-HELP-FS:RemoteBusy" = "Повторите попытку позже.";

"GLOBAL-FS:UNKNOWN"      = "Синхронизация файлов не была завершена из-за возникшей ошибки.";
"GLOBAL-HELP-FS:UNKNOWN" = "Повторите попытку позже.";
